[
  {
    "company": "Reddit",
    "role_level": "Mid Level",
    "principle_name": "Democratic Content Curation",
    "principle_description": "Reddit empowers communities to self-organize and users to democratically determine what content rises to prominence through voting and community moderation.",
    "behavioral_question": "Tell me about a time when you had to design or implement a system that gave decision-making power to users or community members rather than keeping control centralized.",
    "question_type": "Product Strategy",
    "difficulty": "Medium",
    "authentic_quote": "Steve and I set out that June to build a website where readers, not editors, would determine the front page of what's new and interesting by submitting links to be voted on by the community",
    "source_attribution": "Alexis Ohanian, Reddit Co-founder, Sequoia Capital Podcast, 2023"
  },
  {
    "company": "Reddit",
    "role_level": "Senior",
    "principle_name": "Community Empowerment with Boundaries",
    "principle_description": "Reddit's success comes from giving users freedom to create their own communities while maintaining necessary boundaries to prevent harm and ensure productive discussion.",
    "behavioral_question": "Describe a situation where you had to balance giving users or team members significant autonomy while still maintaining appropriate guardrails and standards.",
    "question_type": "Leadership",
    "difficulty": "Hard",
    "authentic_quote": "Neither Alexis nor I created Reddit to be a bastion of free speech, but rather as a place where open and honest discussion can happen",
    "source_attribution": "Steve Huffman, Reddit CEO, Multiple interviews, 2020"
  },
  {
    "company": "Discord",
    "role_level": "Entry Level",
    "principle_name": "Start from Trust and Assume Good Intent",
    "principle_description": "One of Discord's seven working principles emphasizes beginning interactions by trusting others and assuming they have good intentions, fostering a positive collaborative environment.",
    "behavioral_question": "Tell me about a time when you approached a difficult situation or conflict by first assuming positive intent from the other person. What was the outcome?",
    "question_type": "Culture Fit",
    "difficulty": "Easy",
    "authentic_quote": "Running Discord has always been about creating an amazing place to work for all of us",
    "source_attribution": "Jason Citron, Discord Founder, Full Sail University Interview, 2023"
  },
  {
    "company": "Discord",
    "role_level": "Leadership",
    "principle_name": "Employee-First Culture",
    "principle_description": "Discord measures success not just by user growth but by employee satisfaction, creating an environment where people are excited to come to work.",
    "behavioral_question": "Describe a time when you had to choose between a decision that would benefit the business in the short term versus one that would better support your team members' wellbeing or development.",
    "question_type": "Leadership",
    "difficulty": "Hard",
    "authentic_quote": "People spend eight hours a day at work and I'm proud to have created an environment where people are excited to come to work",
    "source_attribution": "Jason Citron, Discord CEO, Full Sail University Interview, 2023"
  },
  {
    "company": "Discord",
    "role_level": "Mid Level",
    "principle_name": "Building Belonging and Community",
    "principle_description": "Discord's mission centers on helping people find belonging and meaningful connections, recognizing that people naturally seek friendship and ways to spend quality time together.",
    "behavioral_question": "Tell me about a project or initiative where you helped create a sense of belonging or community, either within your team or for external users/customers.",
    "question_type": "Values",
    "difficulty": "Medium",
    "authentic_quote": "People are always looking for belonging, friendship, and ways to spend time with people they care about",
    "source_attribution": "Jason Citron, Discord CEO, Index Ventures Interview, 2020"
  },
  {
    "company": "Twitch",
    "role_level": "Senior",
    "principle_name": "First Principles Thinking",
    "principle_description": "Twitch encourages starting from first principles and working backwards rather than copying common solutions, asking if current ideas are really the best way to accomplish end goals.",
    "behavioral_question": "Describe a situation where you questioned conventional wisdom or existing processes and developed a solution by reasoning from first principles. What was your approach and what did you discover?",
    "question_type": "Problem Solving",
    "difficulty": "Hard",
    "authentic_quote": "Before deciding on a course of action, know what ultimate goal you have in mind. Then ask yourself, is my current idea really the very best way to accomplish that goal? Are there alternatives I haven't considered? Whenever possible, start from first principles and work backwards, don't just copy common solutions you've seen before.",
    "source_attribution": "Emmett Shear, Twitch Co-founder, VentureBeat Interview, 2017"
  },
  {
    "company": "Twitch",
    "role_level": "Mid Level",
    "principle_name": "Inclusion as Strategic Advantage",
    "principle_description": "Twitch embraces inclusion not just as a moral imperative but as a business strategy to access the most competent staff, successful creators, and largest audience.",
    "behavioral_question": "Tell me about a time when you advocated for including diverse perspectives or voices in a project or decision-making process. How did this impact the outcome?",
    "question_type": "Values",
    "difficulty": "Medium",
    "authentic_quote": "We embrace inclusion at Twitch because we want to have access to the most competent staff, the most successful content creators, and the largest audience. If we exclude or overlook the best people because of their background, we have committed an injustice twice: once against that person, and once against ourselves because we have lost a valuable member of the Twitch community or a new perspective for no good reason.",
    "source_attribution": "Emmett Shear, Twitch CEO, Company Values Document, 2017"
  },
  {
    "company": "Bumble",
    "role_level": "Leadership",
    "principle_name": "Mission-Driven Decision Making",
    "principle_description": "Bumble's vision of social justice and empowerment drives virtually every company decision, from hiring practices to product features to advocacy positions.",
    "behavioral_question": "Describe a time when you had to make a difficult business decision that aligned with your values or mission, even when it might have been challenging or costly in the short term.",
    "question_type": "Leadership",
    "difficulty": "Hard",
    "authentic_quote": "We're trying to say, 'Let's change thousands of years of behavior. Globally.' Do you see why this is so challenging?",
    "source_attribution": "Whitney Wolfe Herd, Bumble Founder & CEO, TIME Magazine, 2021"
  },
  {
    "company": "Bumble",
    "role_level": "Mid Level",
    "principle_name": "Kindness and Accountability",
    "principle_description": "Bumble engineers accountability into everything they do, believing that kindness spreads kindness and that people lose their kindness when they can act anonymously.",
    "behavioral_question": "Tell me about a time when you had to address poor behavior or hold someone accountable while still maintaining a kind and respectful approach.",
    "question_type": "Culture Fit",
    "difficulty": "Medium",
    "authentic_quote": "I'm a firm believer that, just like hate spreads hate, love and kindness spread love and kindness",
    "source_attribution": "Whitney Wolfe Herd, Bumble CEO, CNBC Interview, 2021"
  },
  {
    "company": "Bumble",
    "role_level": "Entry Level",
    "principle_name": "Solutions-Oriented Problem Solving",
    "principle_description": "Bumble promotes a culture where team members don't just present problems but come prepared with potential solutions and their consequences.",
    "behavioral_question": "Describe a time when you identified a problem at work and came prepared with multiple potential solutions. How did you present the options and what was the outcome?",
    "question_type": "Problem Solving",
    "difficulty": "Easy",
    "authentic_quote": "I can't just listen to problems. Come with two potential solutions",
    "source_attribution": "Whitney Wolfe Herd, Bumble CEO, FastCompany Interview, 2019"
  },
  {
    "company": "Instacart",
    "role_level": "Leadership",
    "principle_name": "Company Before Self",
    "principle_description": "Instacart leaders are counseled to put the company before themselves, take the long-term view, and never be afraid of giving away their responsibilities to create stronger teams.",
    "behavioral_question": "Tell me about a time when you had to give up control of something you built or led in order to benefit the larger organization or team. How did you approach this transition?",
    "question_type": "Leadership",
    "difficulty": "Hard",
    "authentic_quote": "Think about the big picture: to put the company before themselves, to take the long-term view, and to never be afraid of giving away their legos",
    "source_attribution": "Apoorva Mehta, Instacart Founder, Elad Gil Interview, 2023"
  },
  {
    "company": "Instacart",
    "role_level": "Entry Level",
    "principle_name": "Hands-On Customer Understanding",
    "principle_description": "All Instacart corporate employees train as in-store shoppers within their first week to gain firsthand experience and customer feedback, emphasizing deep customer understanding.",
    "behavioral_question": "Describe a time when you went out of your way to gain firsthand experience with your customers' or users' perspective, even if it wasn't part of your typical job duties.",
    "question_type": "Culture Fit",
    "difficulty": "Easy",
    "authentic_quote": "All corporate employees are trained as in-store shoppers within their first week",
    "source_attribution": "Apoorva Mehta, Instacart Founder, Y Combinator Interview, 2019"
  },
  {
    "company": "Instacart",
    "role_level": "Mid Level",
    "principle_name": "Resourcefulness and Resilience",
    "principle_description": "Instacart's success is attributed to the team's resourcefulness, drive, and resilience, including creative problem-solving when traditional approaches fail.",
    "behavioral_question": "Tell me about a time when conventional approaches weren't working and you had to get creative or resourceful to solve a problem with limited resources.",
    "question_type": "Problem Solving",
    "difficulty": "Medium",
    "authentic_quote": "When no retailer would partner with them, the team bought one of every single item from grocery stores, took them to a studio, and photographed everything to build their first catalog",
    "source_attribution": "Apoorva Mehta, Instacart Founder, CNBC Interview, 2023"
  },
  {
    "company": "DoorDash",
    "role_level": "Senior",
    "principle_name": "Getting to the Lowest Level of Detail",
    "principle_description": "DoorDash's core principle emphasizes understanding the lowest level of detail in your business, gained through actually doing the work rather than just observing it.",
    "behavioral_question": "Describe a time when you had to deeply understand a process or problem by getting involved at the most granular level. What did you learn that you wouldn't have discovered otherwise?",
    "question_type": "Problem Solving",
    "difficulty": "Hard",
    "authentic_quote": "We weren't experts in logistics, so we had to be students of it, and the only way we thought we could be students was by actually doing the work",
    "source_attribution": "Tony Xu, DoorDash CEO, Stanford GSB Interview, 2022"
  },
  {
    "company": "DoorDash",
    "role_level": "Leadership",
    "principle_name": "Stakeholder-First Leadership",
    "principle_description": "DoorDash's leadership philosophy centers on empathy and understanding the needs of all stakeholders - customers, delivery drivers, and restaurant partners.",
    "behavioral_question": "Tell me about a difficult decision where you had to balance the competing interests of multiple stakeholders. How did you approach understanding each group's needs?",
    "question_type": "Leadership",
    "difficulty": "Hard",
    "authentic_quote": "If restaurants don't thrive, we cannot. We need to take a leadership position",
    "source_attribution": "Tony Xu, DoorDash CEO, CNBC Interview during COVID-19, 2020"
  },
  {
    "company": "DoorDash",
    "role_level": "Mid Level",
    "principle_name": "Strong Writing Culture",
    "principle_description": "DoorDash has developed a strong writing culture, starting meetings by reading documents that people have written to ensure clear communication and thinking.",
    "behavioral_question": "Describe a time when you used written communication to solve a complex problem or align a team. How did the writing process help clarify your thinking?",
    "question_type": "Teamwork",
    "difficulty": "Medium",
    "authentic_quote": "One of the things we found effective is really writing things down. DoorDash has a pretty strong writing culture and tends to start meetings by reading documents that people have written",
    "source_attribution": "Tony Xu, DoorDash CEO, Stanford GSB Interview, 2022"
  },
  {
    "company": "Airbnb",
    "role_level": "Entry Level",
    "principle_name": "Connection and Belonging",
    "principle_description": "Airbnb's mission centers on creating belonging - the feeling of deep and genuine connection to a person, place, or community, and the feeling of being 'at home'.",
    "behavioral_question": "Tell me about a time when you helped someone feel welcomed, included, or like they belonged in a new environment or situation.",
    "question_type": "Culture Fit",
    "difficulty": "Easy",
    "authentic_quote": "The opposite of loneliness is belonging — the feeling of deep and genuine connection to a person, a place, or community. It's the feeling of being 'at home.' The feeling of being known and loved",
    "source_attribution": "Brian Chesky, Joe Gebbia, Nathan Blecharczyk, Airbnb S-1 Filing, 2020"
  },
  {
    "company": "Airbnb",
    "role_level": "Senior",
    "principle_name": "Design-Driven Problem Solving",
    "principle_description": "At Airbnb, design isn't just how something looks, it's how it fundamentally works, sitting at the intersection of art and science to solve problems.",
    "behavioral_question": "Describe a time when you approached a problem by focusing not just on functionality but on the entire user experience. How did this design-thinking approach change your solution?",
    "question_type": "Problem Solving",
    "difficulty": "Hard",
    "authentic_quote": "At Airbnb, design isn't just how something looks, it's how it fundamentally works. We sit at the intersection of art and science",
    "source_attribution": "Brian Chesky, Airbnb CEO, Company S-1 Filing, 2020"
  },
  {
    "company": "Airbnb",
    "role_level": "Leadership",
    "principle_name": "Culture as Daily Focus",
    "principle_description": "Strong culture requires daily attention and habits. If you want culture to be a core competency, you have to make it a daily focus rather than an occasional consideration.",
    "behavioral_question": "Tell me about a time when you had to consistently reinforce team values or culture through daily actions, not just one-time initiatives. What specific habits or practices did you establish?",
    "question_type": "Leadership",
    "difficulty": "Hard",
    "authentic_quote": "If you want culture or anything else to be a core competency, you have to make it a daily focus. The stronger the culture, the less corporate process a company needs. When the culture is strong, you can trust everyone to do the right thing",
    "source_attribution": "Brian Chesky, Airbnb CEO, Medium Article, 2015"
  },
  {
    "company": "Dropbox",
    "role_level": "Mid Level",
    "principle_name": "Making Work Human",
    "principle_description": "Dropbox focuses on creating an environment where people genuinely care about each other and where success is measured not just by what is achieved but how it's achieved.",
    "behavioral_question": "Describe a situation where you went beyond just completing a project to also focus on how the team worked together and supported each other throughout the process.",
    "question_type": "Teamwork",
    "difficulty": "Medium",
    "authentic_quote": "Making work human will always be at the heart of our culture. Success is measured not just by what we achieve but how we achieve it",
    "source_attribution": "Arash Ferdowsi, Dropbox Co-founder, Dropbox Blog, 2020"
  },
  {
    "company": "Dropbox",
    "role_level": "Entry Level",
    "principle_name": "Simplicity and Universal Accessibility",
    "principle_description": "Dropbox's emphasis on simplicity makes technology accessible to average users, focusing on trustworthy, easy solutions rather than complex functionality.",
    "behavioral_question": "Tell me about a time when you had to take something complex and make it simple and accessible for others to understand or use.",
    "question_type": "Problem Solving",
    "difficulty": "Easy",
    "authentic_quote": "Customers wanted an easy, trustworthy solution rather than complex functionality",
    "source_attribution": "Drew Houston, Dropbox CEO, Tim Ferriss Podcast, 2018"
  },
  {
    "company": "Dropbox",
    "role_level": "Leadership",
    "principle_name": "High Standards with Freedom",
    "principle_description": "Dropbox leadership sets clear goals and high standards while giving people freedom to achieve them in their own ways, creating an approachable yet excellent culture.",
    "behavioral_question": "Describe your approach to setting expectations for your team while still giving them autonomy. How do you balance high standards with individual freedom?",
    "question_type": "Leadership",
    "difficulty": "Hard",
    "authentic_quote": "Employees love how their CEO sets clear goals but gives people the freedom to achieve them in their own ways",
    "source_attribution": "Drew Houston, Dropbox CEO, Various Employee Reviews, 2019"
  },
  {
    "company": "GitLab",
    "role_level": "Entry Level",
    "principle_name": "Radical Transparency",
    "principle_description": "GitLab operates with everything public by default - from their handbook to processes to infrastructure - believing transparency creates awareness and enables better collaboration.",
    "behavioral_question": "Tell me about a time when you chose to be more transparent about a process, mistake, or challenge than might have been expected. What was the impact of that transparency?",
    "question_type": "Culture Fit",
    "difficulty": "Easy",
    "authentic_quote": "Everything GitLab does is public by default. Transparency is sunlight",
    "source_attribution": "Sid Sijbrandij, GitLab CEO, Distributed.blog Podcast, 2021"
  },
  {
    "company": "GitLab",
    "role_level": "Mid Level",
    "principle_name": "Iteration with Low Shame",
    "principle_description": "GitLab believes the smallest possible change that makes any improvement should be published, embracing a culture of continuous iteration without shame about imperfection.",
    "behavioral_question": "Describe a time when you chose to share or implement an imperfect solution quickly rather than waiting to perfect it. How did you handle the feedback and iteration process?",
    "question_type": "Problem Solving",
    "difficulty": "Medium",
    "authentic_quote": "The smallest possible change that makes any improvement should be published, and with a low level of shame",
    "source_attribution": "Sid Sijbrandij, GitLab CEO, Distributed.blog Podcast, 2021"
  },
  {
    "company": "GitLab",
    "role_level": "Senior",
    "principle_name": "Documentation-First Culture",
    "principle_description": "GitLab writes down every process and procedure, believing every conversation must be captured appropriately to enable remote collaboration and knowledge sharing.",
    "behavioral_question": "Tell me about a time when you created comprehensive documentation that significantly improved how your team or others could understand and replicate a process or solution.",
    "question_type": "Teamwork",
    "difficulty": "Medium",
    "authentic_quote": "At GitLab, employees write every process and procedure down and believe that every conversation must be captured appropriately—everything is documented",
    "source_attribution": "Sid Sijbrandij, GitLab CEO, Various interviews, 2020"
  },
  {
    "company": "Indeed",
    "role_level": "Mid Level",
    "principle_name": "Scrappy DNA and Bootstrapping",
    "principle_description": "Indeed developed a scrappy DNA of doing a lot with a little, bootstrapping their business and learning to build efficiently during difficult times.",
    "behavioral_question": "Describe a time when you had to accomplish significant results with limited resources. How did you prioritize and make the most of what you had available?",
    "question_type": "Problem Solving",
    "difficulty": "Medium",
    "authentic_quote": "We bootstrapped our first venture, developing this, kind of, very scrappy DNA of doing a lot with a little and bootstrapping the business. And I think that served us in good stead thereafter",
    "source_attribution": "Paul Forster, Indeed Co-founder, Invested Investor Interview, 2019"
  },
  {
    "company": "Indeed",
    "role_level": "Leadership",
    "principle_name": "Making Your Own Path",
    "principle_description": "Indeed's founders emphasize that entrepreneurs must make their own path rather than following others' advice, as that independent thinking leads to success.",
    "behavioral_question": "Tell me about a time when you chose to go against conventional wisdom or ignore well-meaning advice to pursue what you believed was the right approach.",
    "question_type": "Leadership",
    "difficulty": "Hard",
    "authentic_quote": "You have to make your own path. A lot of people will give you advice and tell you how to run your business, but you have to make your own path. That's what is going to be successful",
    "source_attribution": "Rony Kahan, Indeed CEO, Silicon Hills News, 2012"
  },
  {
    "company": "Indeed",
    "role_level": "Entry Level",
    "principle_name": "Focus and Execution",
    "principle_description": "Indeed's philosophy emphasizes doing one thing really well and focusing on execution rather than trying to do everything at once.",
    "behavioral_question": "Describe a situation where you had to resist the temptation to take on multiple projects and instead focus deeply on executing one thing exceptionally well.",
    "question_type": "Problem Solving",
    "difficulty": "Easy",
    "authentic_quote": "Do one thing and do that really well and focus on execution",
    "source_attribution": "Rony Kahan, Indeed CEO, Silicon Hills News, 2012"
  },
  {
    "company": "HubSpot",
    "role_level": "Leadership",
    "principle_name": "Culture as Product",
    "principle_description": "HubSpot treats culture like an engineering project and product, creating an operating system for the company that provides exceptional value to employees.",
    "behavioral_question": "Describe how you've approached building or improving team culture systematically, treating it as seriously as you would any other important business outcome.",
    "question_type": "Leadership",
    "difficulty": "Hard",
    "authentic_quote": "If I could write an operating system to run the company, what would that operating system look like? We treat culture as a product and that has been game changing for us internally",
    "source_attribution": "Dharmesh Shah, HubSpot Co-founder, First Round Review, 2020"
  },
  {
    "company": "HubSpot",
    "role_level": "Senior",
    "principle_name": "Zigging When Others Zag",
    "principle_description": "HubSpot's founders believe in doing things that are counterintuitive and fighting conventional wisdom, watching competition but never following them.",
    "behavioral_question": "Tell me about a time when you identified an opportunity to do something completely different from what everyone else in your field was doing. What was your reasoning and what happened?",
    "question_type": "Problem Solving",
    "difficulty": "Hard",
    "authentic_quote": "We have not been afraid to fight conventional wisdom. We had a professor in business school who used to always say, 'Watch the competition, but never follow them.' So we were never afraid to zig whenever they were zagging",
    "source_attribution": "Brian Halligan, HubSpot CEO, First Round Review, 2019"
  },
  {
    "company": "HubSpot",
    "role_level": "Mid Level",
    "principle_name": "Empathy as Core Value",
    "principle_description": "HubSpot's 'inbound' philosophy centers on empathy - seeing things from others' perspectives and approaching situations from that person's viewpoint to fundamentally care about customers and each other.",
    "behavioral_question": "Describe a time when you had to understand a problem or opportunity by deeply considering multiple stakeholders' perspectives. How did this empathetic approach change your solution?",
    "question_type": "Values",
    "difficulty": "Medium",
    "authentic_quote": "The very essence of being 'inbound-y' is to be empathetic. To not only see things from the other person's perspective, but to approach things from that person's perspective. What will differentiate us in the future is what has differentiated us in the past: We fundamentally care about our customers and each other",
    "source_attribution": "Dharmesh Shah, HubSpot Co-founder, Company Culture Code, 2013"
  },
  {
    "company": "Wayfair",
    "role_level": "Entry Level",
    "principle_name": "Open and Transparent Workplace",
    "principle_description": "Wayfair supports an open, transparent workplace with completely open office layouts to make communication easier, help people know what's going on, and increase energy levels.",
    "behavioral_question": "Tell me about a time when you proactively shared information or made your work more visible to others, even when it wasn't required. What was the impact on your team or project?",
    "question_type": "Culture Fit",
    "difficulty": "Easy",
    "authentic_quote": "By having an open layout, it makes it a lot easier for folks to know what's going on, makes communication a lot easier and it actually increases the energy level",
    "source_attribution": "Niraj Shah, Wayfair CEO, Boston.com Interview, 2016"
  },
  {
    "company": "Wayfair",
    "role_level": "Mid Level",
    "principle_name": "Marathon Not Sprint Mentality",
    "principle_description": "Wayfair treats their business like a marathon, not a sprint, emphasizing long-term thinking and sustainable growth over quick wins.",
    "behavioral_question": "Describe a project or goal where you had to resist pressure for quick results and instead focused on building something sustainable for the long term. How did you maintain momentum?",
    "question_type": "Problem Solving",
    "difficulty": "Medium",
    "authentic_quote": "We treat our business like a marathon, not a sprint",
    "source_Attribution": "Steve Conine, Wayfair Co-founder, Cornell Chronicle, 2018"
  },
  {
    "company": "Wayfair",
    "role_level": "Senior",
    "principle_name": "Passion-Driven Pursuit",
    "principle_description": "Wayfair's founders emphasize only pursuing ideas you're genuinely passionate and excited about, as passion helps you get through tough patches and continue believing.",
    "behavioral_question": "Tell me about a challenging project or goal you pursued primarily because you believed in it deeply, even when others were skeptical or obstacles seemed insurmountable.",
    "question_type": "Values",
    "difficulty": "Hard",
    "authentic_quote": "Only pursue ideas that you are really passionate and excited about. Because even when something succeeds, it's not a nice straight line, so the way you get through the really tough patches is when you believe in something. That's what keeps you going",
    "source_attribution": "Niraj Shah, Wayfair CEO, Cornell Chronicle, 2018"
  }
]